rtsbd/scenario9/canceldeadlineRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rts="http://www.rts.co.kr/">
<soapenv:Header>
   <rts:BaseInfo>
      <!--Optional:-->
      <rts:SiteCode>CTM1X-00</rts:SiteCode>
      <!--Optional:-->
      <rts:Password>test1234</rts:Password>
      <!--Optional:-->
      <rts:RequestType>NetPartner</rts:RequestType>
   </rts:BaseInfo>
</soapenv:Header>
<soapenv:Body>
   <rts:GetCancelDeadlineForCustomerCount>
      <rts:GetCancelDeadline>
         <!--Optional:-->
         <rts:ItemCode>SEL0001</rts:ItemCode>
         <rts:ItemNo>30</rts:ItemNo>
         <!--Optional:-->
         <rts:RoomTypeCode>20200701|20200703|W|435|128032|TWN.DX|FIT|RO||1~2~0||N@04~~20c77~-1751002900~N~~9EFDEF54851C4F6158037749818602PAAR0000028002600060820c77:BBJ.BC:twin deluxe::A0#B0#C0#D0#E0|HZGRDKBD|~None</rts:RoomTypeCode>
         <!--Optional:-->
         <rts:CheckInDate>2020-07-01</rts:CheckInDate>
         <!--Optional:-->
         <rts:CheckOutDate>2020-07-03</rts:CheckOutDate>
         <!--Optional:-->
         <rts:GuestList>
            <!--Zero or more repetitions:-->
            <rts:GuestsInfo>
               <rts:AdultCount>2</rts:AdultCount>
               <rts:ChildCount>0</rts:ChildCount>
               <rts:RoomCount>1</rts:RoomCount>
               <rts:ChildAge1>0</rts:ChildAge1>
               <rts:ChildAge2>0</rts:ChildAge2>
            </rts:GuestsInfo>
         </rts:GuestList>
         <!--Optional:-->
         <rts:LanguageCode>AR</rts:LanguageCode>
         <!--Optional:-->
         <rts:TravelerNationality>AR</rts:TravelerNationality>
      </rts:GetCancelDeadline>
   </rts:GetCancelDeadlineForCustomerCount>
</soapenv:Body>
</soapenv:Envelope>